{
  "scenes": [
    {
      "id": 1,
      "description": "At the crossroads of destiny, two paths lie before you: The Enchanted Forest to your left, The Forgotten Ruins to your right.",
      "choices": [
        {
          "text": "Take the path to The Enchanted Forest",
          "leads_to": 2
        },
        {
          "text": "Take the path to The Forgotten Ruins",
          "leads_to": 6
        }
      ],
      "characters": []
    },
    {
      "id": 2,
      "description": "You find yourself in a clearing with two mystical doors carved into the trees and a glowing bucket in the center.",
      "choices": [
        {
          "text": "Open the door to your left",
          "leads_to": 3,
          "required_items": ["key"]
        },
        {
          "text": "Open the door to your right",
          "leads_to": 4,
          "required_items": ["key"]
        },
        {
          "text": "Look in the bucket",
          "leads_to": 5
        }
      ],
      "characters": ["Mystical Deer", "Whispering Trees"]
    },
    {
      "id": 3,
      "description": "You go through the door on the left, down a set of stairs. There is an underground cave. It is strange that it is well lit. A spectral guardian guards a hole in the wall at the edge of the cave.",
      "choices": [
        {
          "text": "Try and enter the cave",
          "leads_to": ,
          "required_items": ["special item"]
        },
        {
          "text": "Return to the clearing",
          "leads_to": 
        },
        {
          "text": "Talk to the guardian",
          "leads_to": 
        }
      ],
      "characters": {"Spectral Guardian": "You are a guardian in an interactive story game. You do not say much. Your job is to guard the cave. You can only speak in single sentences. Occasionally, during the conversation, warn the player not to mess with you or it could get dangerous. Speak in a fantasy, historical way. Occasionally, during the conversation, hint that the player that you are talking to, needs a special item, and that you may let him past."}
    },
    {
      "id": 4,
      "description": "You go through the door on your right and enter into dense foliage. You push away the branches and leaves and see a cabin in the middle of the forest. You are nervous as you approach. You knock on the door and a old man answers.",
      "choices": [
        {
          "text": "Talk to the old man",
          "leads_to": 
        },
        {
          "text": "Apologize and move on.",
          "leads_to": 
        },
        {
          "text": "Ask to come inside",
          "leads_to": 
        }
      ],
      "characters": {"Old Man": "You are a character in an interactive story game. You are an old man who lives in a cabin in the woods. You are secretly evil but the player does not know that. When answering the player, do not respond with too much dialog but keep it friendly."}
    },
    {
      "id": 5,
      "description": "You find a rusty key in the bucket.",
      "choices": [
        {
          "text": "Take the key",
          "leads_to": 2,
          "add_item": "key"
        },
        {
          "text": "Leave the bucket and go back to the room",
          "leads_to": 2
        }
      ],
      "characters": []
    },
    {
      "id": 6,
      "description": "Crumbling gates lead into the ruins. A broken statue holds a small chest.",
      "choices": [
        {
          "text": "Open the door to your left",
          "leads_to": 7
        },
        {
          "text": "Open the door to your right",
          "leads_to": 8
        },
        {
          "text": "Examine the broken statue",
          "leads_to": 11
        }
      ],
      "characters": ["Guardian Statues"]
    },
    {
      "id": 7,
      "description": "A vast hall with echoes of the past. A heavy iron door stands closed.",
      "choices": [
        {
          "text": "Use the emblem to unlock the iron door",
          "leads_to": 12
        },
        {
          "text": "Return to the gates",
          "leads_to": 6
        }
      ],
      "characters": ["Echoing Shadows"]
    },
    {
      "id": 8,
      "description": "A throne room cloaked in shadows. A shadowy door is hidden behind the throne.",
      "choices": [
        {
          "text": "Use the jewel to reveal the true door",
          "leads_to": 13
        },
        {
          "text": "Return to the gates",
          "leads_to": 6
        }
      ],
      "characters": ["Ancient Kings"]
    },
    {
      "id": 9,
      "description": "The spectral guardian vanishes, allowing you to pass. You discover a hidden grove beyond.",
      "ending": true,
      "characters": []
    },
    {
      "id": 10,
      "description": "The crystal door opens, revealing a chamber filled with ancient treasures. Your journey is rewarded.",
      "ending": true,
      "characters": []
    },
    {
      "id": 11,
      "description": "As you look at the statue, you notice a small chest. Inside the chest, you find an old, iron key.",
      "choices": [
        {
          "text": "Take the key and open the door to the left",
          "leads_to": 7
        },
        {
          "text": "Take the key and open the door to the right",
          "leads_to": 8
        },
        {
          "text": "Leave the key and return to the gates",
          "leads_to": 6
        }
      ],
      "characters": []
    },
    {
      "id": 12,
      "description": "The emblem unlocks the iron door, revealing an ancient library filled with forgotten knowledge.",
      "ending": true,
      "characters": ["Ancient Librarians"]
    },
    {
      "id": 13,
      "description": "The jewel reveals the true door through the shadows. Behind it lies the ancient throne, crowned with priceless artifacts.",
      "ending": true,
      "characters": []
    }
  ]
}
